const examples = [{"id": "variables",
		   "title": "വാരിയബിൾസ് (variables)",
		   "code": "/* ആദ്യം വാരിയബിൾസ് ഉണ്ടാക്കാം. */\n\n ആവട്ടെ ക, ച;\n\n /* എന്നിട്ട് അവയുടെ മൂല്യങ്ങൾ നിർണയിക്കാം.\n\n ഇവിടെ ക്ലിക്ക് ചെയ്തു നിങ്ങൾക്കിഷ്ടമുള്ളത് പോലെ\nഈ സംഖ്യകൾ മാറ്റി നോക്കാം. */\n\nക = 2, ച = 4;\n\n/* പിന്നെ അവ തമ്മിൽ കൂട്ടാം.\n ഈ പ്രവർത്തിയുടെ റിസൾട്ട് കീഴേ\n കാണാവുന്നതാണ്. */\n\nക + ച;"},
		  {"id": "functions",
		   "title": "ഫങ്ങ്ഷൻസ് (functions)",
		   "code": "/* ഫങ്ങ്ഷൻസ് ഉണ്ടാകുന്നത് എങ്ങനെയെന്ന് നോക്കാം.\nഒരു സംഖ്യയുടെ വർഗ്ഗം എന്നാൽ ആ സംഖ്യ കൊണ്ട് അതിനെ\nതന്നെ ഗുണിച്ചത്. */\n\nപ്രയോഗം വർഗ്ഗം(സംഖ്യ) {\n\nമടക്കം സംഖ്യ * സംഖ്യ;\n\n}\n\n/* ഇങ്ങനെ ഉണ്ടാക്കിയ ഫങ്ങ്ഷനെ ഇപ്രകാരം വിളിക്കാം. */\n\n വർഗ്ഗം(വർഗ്ഗം(4));"},
		  {"id": "conditionals",
		   "title": "നിബന്ധനകൾ (conditionals)",
		   "code": "ആവട്ടെ കിട്ടിയാൽ = ശരി;\n\nആണെങ്കിൽ(കിട്ടിയാൽ) \"ഊട്ടി\";\nഅല്ലെങ്കിൽ \"ചട്ടി\";"},
		  {"id": "squaresum",
		   "title": "വർഗ്ഗങ്ങളുടെ തുക (Sum of squares)",
		   "code":"/* ഇനി കുറച്ചു വികസിതമായ ഉദാഹരണം കാണാം.\nസംഖ്യയുടെ വർഗ്ഗം: ആ സംഖ്യ കൊണ്ട് അതിനെ തന്നെ ഗുണിച്ചത് */\n\nപ്രയോഗം വർഗ്ഗം(സംഖ്യ) {\n\n\nമടക്കം സംഖ്യ * സംഖ്യ;\n\n}\n\n/* രണ്ടു സംഖ്യകളുടെ വർഗ്ഗത്തിന്റെ ആകെ തുക */\n\nപ്രയോഗം വർഗ്ഗത്തുക(ഒരു_സംഖ്യ, മറ്റൊരു_സംഖ്യ) {\n\nമടക്കം വർഗ്ഗം(ഒരു_സംഖ്യ) + വർഗ്ഗം(മറ്റൊരു_സംഖ്യ);\n\n}\n\nവർഗ്ഗത്തുക(3,4);"},
		  {"id": "currying",
		   "title": "കറിവെക്കൽ (currying)",
		   "code": "/* പ്രോഗ്രാമിങ്ങിലെ ആശയമായ കറി എങ്ങനെ പ്രയോഗിക്കാമെന്നു നോക്കാം */\n\nപ്രയോഗം ഹരണം_കറി(വിഭേദനി) {\n\nമടക്കം പ്രയോഗം(സംഖ്യ) {\n\nമടക്കം സംഖ്യ/വിഭേദനി;\n\n}\n}\n\n ആവട്ടെ പാതി = ഹരണം_കറി(2);\n\n പാതി(48);"},
		  {"id": "objects",
		   "title": "മുകുന്ദേട്ടാ സുമിത്ര വിളിക്കുന്നു (objects)",
		   "code":
		   "ആവട്ടെ മുകുന്ദൻ = {\nപേര്: \"മുകുന്ദൻ\",\nവിളിപ്പേര്: \"മുകുന്ദേട്ടാ\",\nവിളി: (വ്യക്തി) => {\nമടക്കം വ്യക്തി.വിളിപ്പേര് + \" മുകുന്ദൻ വിളിക്കുന്നു\"; \n}};\n\nആവട്ടെ സുമിത്ര = {\nപേര്: \"സുമിത്ര\",\nവിളിപ്പേര്: \"സുമിത്രേച്ചി\",\nവിളി: (വ്യക്തി) => {\nമടക്കം വ്യക്തി.വിളിപ്പേര് + \" സുമിത്ര വിളിക്കുന്നു\";\n}};\n\nസുമിത്ര.വിളി(മുകുന്ദൻ);"}]

export  { examples };
